export const regExp = {
  // 正实数，小数点后保留一位
  weight: /^[0-9]+(\.[0-9]{1})?$/,
  // 非0正整数
  axesNumber: /[1-9]\d*/,
  // 非0正数
  nonzeroNumber: /^0{1}(\.\d*)|(^[1-9][0-9]*)+(\.\d*)?$/,
  // 正整数
  isPositiveInteger: /^\d*$/,
  // 1-一百万正整数
  isMillionPositiveIntegers: /^(?:(?!0{1,6})\d{1,6}|10{6}|0)$/,
  // 1-10000正整数
  isTenThousandPositiveIntegers: /^(?:(?!0{1,4})\d{1,4}|10{4}|0)$/,
  // 手机号
  phone: /^1[34578]\d{9}$/,
  // 固话
  telephone: /^(0\d{2}-\d{8}(-\d{1,4})?)|(0\d{3}-\d{7,8}(-\d{1,4})?)$/,
  // 身份证号码
  idCard: /^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,
  //年龄
  ageNumber: /^(?:[1-9][0-9]?|1[01][0-9]|120)$/,
  //账户
  account: /^[\\u4e00-\\u9fa5_a-zA-Z0-9-]{4,16}$/,
  // 邮箱
  email: /^[A-Za-z0-9\u4e00-\u9fa5]+@[a-zA-Z0-9_-]+(\.[a-zA-Z0-9_-]+)+$/,
  // 空字符串
  emptyStr: /^$/
}
